cases/floating/rotational_x/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{{
	format		ascii;
	class		dictionary;
	object		blockMeshDict;
}}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin {lb:.12f};
xmax {ub:.12f};
neglinner {lb_inner:.12f};
linner {ub_inner:.12f};

radius {radius:.12f};
negradius {negative_radius:.12f};
trigradius {sin45_radius:.12f};
negtrigradius {negative_sin45_radius:.12f};
coradius {cos225_radius:.12f};
negcoradius {negative_cos225_radius:.12f};
siradius {sin225_radius:.12f};
negsiradius {negative_sin225_radius:.12f};

xcells {resolution:d};
radialcellshalf {resolution_half:d};
radialcellsquarter {resolution_quarter:d};

vertices        
(
    ($xmin $neglinner 0         )
    ($xmin $neglinner $neglinner)
    ($xmin $linner    $neglinner)
    ($xmin $linner    0         )
    ($xmax $neglinner 0         )
    ($xmax $neglinner $neglinner)
    ($xmax $linner    $neglinner)
    ($xmax $linner    0         )
    
    ($xmin $negradius     0             )
    ($xmin $negtrigradius $negtrigradius)
    ($xmin $trigradius    $negtrigradius)
    ($xmin $radius        0             )   
    ($xmax $negradius     0             )
    ($xmax $negtrigradius $negtrigradius)
    ($xmax $trigradius    $negtrigradius)
    ($xmax $radius        0             )
    
    
);

blocks          
(
    hex ( 0  1  2  3  4  5  6  7) all ($radialcellsquarter $radialcellshalf    $xcells) simpleGrading (1 1 1)
    hex ( 8  9  1  0 12 13  5  4) all ($radialcellsquarter $radialcellsquarter $xcells) simpleGrading (1 1 1)
    hex ( 1  9 10  2  5 13 14  6) all ($radialcellsquarter $radialcellshalf    $xcells) simpleGrading (1 1 1)
    hex ( 2 10 11  3  6 14 15  7) all ($radialcellsquarter $radialcellsquarter $xcells) simpleGrading (1 1 1)
);

edges           
(
    arc 10 11   ($xmin $coradius    $negsiradius)
    arc 14 15   ($xmax $coradius    $negsiradius)
    arc  8  9   ($xmin $negcoradius $negsiradius)
    arc 12 13   ($xmax $negcoradius $negsiradius)
    arc  9 10   ($xmin 0            $negradius)
    arc 13 14   ($xmax 0            $negradius)
);

boundary        
(
    
    minX
    {{
        type wall;
	faces
	( 
            (0 1 2 3)
            (8 9 1 0) 
            (1 9 10 2)
            (2 10 11 3)
	);
    }}

    maxX
    {{
        type wall;
	faces
	( 
            (4 5 6 7)
            (12 13 5 4)
            (5 13 14 6)
            (6 14 15 7)
	);
    }}

    outside
    {{
        type wall;
	faces
	( 
            (8 9 12 13)
            (11 10 15 14)
            (10 9 14 13)
	);
    }}
    
    surface
    {{
        type symmetry;
        faces
        (
            (0 3 4 7)
            (8 0 12 4)
            (3 11 7 15)
        );
    }} 
);


mergePatchPairs 
(
);

